Repository: jpawlowski/openvpn-als
Catalog: language/src/ZH-CN/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: Complete.
zh_cn: 完成.

source: Synchronizing
zh_cn: 正在同步

source: Sending sync.
zh_cn: 发送 sync.

source: message to {0}
zh_cn: 消息到 {0}

source: Connected to {0}, waiting for results
zh_cn: 已连接到 {0}, 等待结果

source: Synchronized OK.
zh_cn: 同步OK.

source: Failed to synchronize.
zh_cn: 同步失败.

source: Failed to sync.
zh_cn: sync失败.

source: Requesting agent descriptor using {0}.
zh_cn: 请求使用代理描述器{0}.

source: Using Java >= 1.5, setting connection timeout.
zh_cn: 使用 Java >= 1.5, 设定连接超时

source: Agent (Tunneling)
zh_cn: 代理(隧道)

source: Message resources for the OpenVPN-ALS Agent Base components.
zh_cn: OpenVPN-ALS代理基础组件的信息资源

source: The tunnel failed to start: {0}
zh_cn: 启动隧道失败：{0}

source: No tunnel has been initialised.
zh_cn: 没有隧道被初始化.

source: No UPD socket has been initialised.
zh_cn: 没有UPD socket被初始化.

source: Waiting for packet size from tunnel
zh_cn: 从隧道中，等待数据包大小

source: Waiting for UDP packet
zh_cn: 等待UDP数据包

source: Failed to start UDP tunnel.
zh_cn: 启动UDP隧道失败 .

source: Error reading tunnel.
zh_cn: 对隧道错误

source: Closing UDP socket
zh_cn: 正在关闭 UDP socket

source: Closing UDP tunnel
zh_cn: 正在关闭UDP隧道

source: Connector closed
zh_cn: 连接关闭了

source: Starting permanent local connection listen on port {0}
zh_cn: 正在开启永久本地连接监听端口{0}

source: Starting temporary local connection listen on port {0}
zh_cn: 正在开启暂时本地连接监听端口{0}

source: UDP socket created on {0}:{1}
zh_cn: UDP socket 创建于 {0}:{1}

source: TCP socket created on {0}:{1}
zh_cn: TCP socket创建于 {0}:{1}

source: Failed to register tunnel.
zh_cn: 注册隧道失败l.

source: Registration complete
zh_cn: 注册完成

source: Failed to register tunnel with server.
zh_cn: 向服务器注册隧道失败

source: Closing permanent listener on {0}:{1}
zh_cn: 正在关闭永久监听在 {0}:{1}

source: Closing temporary listener on {0}:{1}
zh_cn: 正在关闭暂时监听在 {0}:{1}

source: Failed to connect tunneling request
zh_cn: 连接隧道请求失败

source: Tunneling request received for {0}:{1}
zh_cn: 收到隧道请求为 {0}:{1}

source: Not accepting any more connections as this is a temporary tunnel.
zh_cn: 不接受更多的连接因为这是个暂时的隧道

source: The connection listener thread failed
zh_cn: 连接监听线程失败了

source: Closing listener as this is a temporary tunnel
zh_cn: 正在关闭连接因为这是个暂时的隧道

source: Not closing listener as this is not a temporary tunnel
zh_cn: 不关闭连接因为这不是个暂时的隧道 tunnel

source: User on {0} has opened a tunnel to {1}:{2}
zh_cn: 用户在{0} 有一个开启的隧道{1}:{2}

source: User on {0} has closed the tunnel to {1}:{2}
zh_cn: 用户在{0} 有一个关闭的隧道{1}:{2}

source: Either the input or output tunnel streams could not be obtained.
zh_cn: 无论是输入或输出通道流都无法获得

source: Waiting for source address / port from tunnel
zh_cn: 等待源地址/端口从隧道

source: Source is {0}:{1} packet port {2}
zh_cn: 源是 {0}:{1} 数据包的端口 {2}

source: Got packet size - expecting {0} bytes
zh_cn: 得到数据包的大小 - 期望是{0}字节

source: Tunneling {0} UDP bytes to {1} / {2} [ {3} ]
zh_cn: 隧道 {0} UDP字节有 {1} / {2} [ {3} ]

source: Got UDP packet of {0} bytes
zh_cn: 得到UDP数据包{0}字节

source: Address is {0}:{1}
zh_cn: 地址是{0}:{1}

source: Writing UDP packet of {0} bytes back to the string [ {1} ]
zh_cn: 写UDP数据包{0} 字节到字符串[ {1} ]

source: Flushed
zh_cn: 冲掉

source: Opened local tunnel listener "{0}" on port {1} to {2}.
zh_cn: 打开本地隧道"{0}" 在端口 {1} to {2}.

source: Closing local tunnel listener "{0}" on port {1} to {2}.
zh_cn: 正在关闭本地隧道"{0}" 在端口 {1} to {2}.

source: Opened remote tunnel listener "{0}" on port {1} to {2}.
zh_cn: 打开远程的隧道 "{0}" 在端口 {1} to {2}.

source: Closing remote tunnel listener "{0}" on port {1} to {2}.
zh_cn: 关闭远程隧道"{0}" 在端口 {1} to {2}.

source: Incoming Remote Tunnel Connection
zh_cn: 传入的远程隧道连接

source: The OpenVPN-ALS Agent has detected an incoming remote tunnel to {0} .
zh_cn: OpenVPN-ALS代理检测到传入的远程隧道到 {0} .

source: Do you wish to accept this connection.
zh_cn: 你希望接受这个连接么

source: Accept
zh_cn: 接受

source: Reject
zh_cn: 拒绝

source: Agent (Utility)
zh_cn: 代理 (应用)

source: Message resources for the OpenVPN-ALS Agent Utility components.
zh_cn: OpenVPN-ALS代理应用组件的信息资源

source: Buffer size must be greater than zero!
zh_cn: 缓冲区大小必须大于零

source: Exception in finding browser: {0}
zh_cn: 在被查找的浏览器中有异常: {0}

source: Unable to locate browser: {0}
zh_cn: 不能启动本地浏览器: {0}

source: InvocationTargetException while creating AEDesc: {0}
zh_cn: InvocationTargetException 当创建AEDesc的时候: {0}

source: IllegalAccessException while building AppleEvent: {0}
zh_cn: IllegalAccessException当建立 AppleEvent: {0}

source: InstantiationException while creating AEDesc: {0}
zh_cn: InstantiationException 当创建AEDesc的时候: {0}

source: Unable to launch URL: {0}
zh_cn: 不能发送 URL: {0}

source: Unable to create an Internet Config instance: {0}
zh_cn: 无法创建一个互联网配置实例: {0}

source: InvocationTargetException while calling openURL: {0}
zh_cn: InvocationTargetException 当调用 openURL的时候: {0}

source: IllegalAccessException while calling openURL: {0}
zh_cn: IllegalAccessException 当调用 openURL的时候: {0}

source: InterruptedException while launching browser: {0}
zh_cn: InterruptedException当开始浏览器的时候: {0}

source: Comment or Element
zh_cn: 评论或元素

source: Invalid value set (entity name = "{0}")
zh_cn: 无效的设定值（实体名称="{0}")

source: Attribute "{0}" does not contain a valid value ("{0}")
zh_cn: 属性 "{0}" 不包含一个有效值("{0}")

source: XML Parse Exception during parsing of {0}: {1}
zh_cn: 解析XML的解析过程中的异常 {0}: {1}

source: Unexpected end of data reached
zh_cn: 未期望的到达数据底部

source: Syntax error while parsing {0}
zh_cn: 语法错误在解析过程中 {0}

source: Expected: {0}
zh_cn: 期望的: {0}

source: XML Parse Exception during parsing of {0}: at {1}: {2}
zh_cn: 解析XML的解析过程中的异常 {0}: 在 {1}: {2}

source: Unknown or invalid entity: &{0};
zh_cn: 未知或无效实体: &{0};

source: Checking parameters
zh_cn: 正在检查参数

source: name is a required parameter
zh_cn: 需要参数名

source: <if> element requires type specific attributes or parameter/value attributes
zh_cn: <if> 元素需要输入特定属性或参数/值属性

source: ticket is a required parameter
zh_cn: 票需要一个参数

source: Storing ticket {0}
zh_cn: 存储票 {0}

source: Getting descriptor stream
zh_cn: 正在得到描述器数据流

source: Reading descriptor stream
zh_cn: 正在读取描述器数据流

source: Parsing descriptor
zh_cn: 正在解析描述器

source: Parsed descriptor
zh_cn: 已解析描述器

source: Read block of {0} bytes.
zh_cn: 读块{0}字节.

source: User home is {0}
zh_cn: 用户目录是{0}

source: Installing to
zh_cn: 安装到

source: Adding file {0} ({1})
zh_cn: 添加文件{0} ({1})

source: Downloading {0} to {1}
zh_cn: 正在下载{0} 到 {1}

source: Using a 1.5 runtime, so setting connection and read timeout to 20 seconds
zh_cn: 使用1.5运行环境,所以设置连接和20秒读取超时

source: Received a response from server
zh_cn: 从服务器得到响应

source: File exists - current checksum = {0}, files checksum = {1}
zh_cn: 文件已存在- 当前的校验 = {0}, 文件校验 = {1}

source: Checksum mismatch, downloading
zh_cn: 校验不匹配，正在下载

source: Missing or invalid size for file {0}.
zh_cn: 遗失或无效的文件大小 {0}.

source: File doesn't exists downloading
zh_cn: 文件不存在下载

source: Request application using {0}
zh_cn: 请求应用程序使用 {0}

source: Completed downloading files
zh_cn: 完成下载文件

source: URL does not point to an application descriptor
zh_cn: URL没有指向应用程序描述器

source: Replacements created, preparation of launcher complete.
zh_cn: 更换建立，准备launcher已完成。.

source: Failed to load the application descriptor for application type of {0}
zh_cn: 为应用程序类型读取应用程序描述器失败 {0}

source: Applying parameter transformations
zh_cn: 应用参数变化

source: Tunnel required but no event handler is available
zh_cn: 隧道所需的事件处理程序，但没有提供

source: Application name is {0} ({1})
zh_cn: 应用程序的名字是 {0} ({1})

source: Adding parameter {0} with a value of {1}
zh_cn: 添加参数 {0} 值设定为 {1}

source: Creating install folder
zh_cn: 创建安装文件夹

source: Creating replacements
zh_cn: 创建更换

source: Invalid element <{0}> found in <files>
zh_cn: 无效的内容<{0}> 发现<files>

source: Expected checksum and size for file object {0}.
zh_cn: 预期的校验和大小为文件对象 {0}.

source: Creating {0}
zh_cn: 创建 {0}

source: Finshing download file.
zh_cn: 正在完成下载文件.

source: Making {0} executable.
zh_cn: 使 {0} 可执行.

source: Failed to make {0} executable.
zh_cn: 使 {0} 可执行失败.

source: Making {0} read only.
zh_cn: 使 {0} 只读.

source: Failed to make {0} read only.
zh_cn: 使{0} 只读失败.

source: Failed to create a required tunnel to {0}:{1}
zh_cn: 未能创造要求的隧道{0}:{1}

source: Failed to parse XML.
zh_cn: 无法解析的XML.

source: No parameters to test against.
zh_cn: 没有要测试的参数.

source: <transform> element requires class, input and output attributes!
zh_cn: <transform> 元素需要类，输入和输出的属性!

source: Loading transformation class
zh_cn: 读取转变类

source: Creating transformation instance
zh_cn: 创建转变实例

source: Invoking transformation
zh_cn: 激活转变

source: Exception in Transformation class:
zh_cn: 转变类异常转变类:

source: Error!
zh_cn: 错误!

source: Element is not <replacements>
zh_cn: 元素 <replacements>

source: <replacements> element requires 'templateFile' attribute
zh_cn: <replacements> 元素需要 '模板文件' 属性

source: Template file will be {0}
zh_cn: 模板文件是{0}

source: Output file will be {0}
zh_cn: 输出文件是{0}

source: <replacements> element requires 'parameter' attribute
zh_cn: <replacements> 元素需要 '参数' 属性

source: Output file will be encoded in {0}
zh_cn: 输出文件用编码{0}

source: <{0}> is not a supported element of <replace>
zh_cn: <{0}> 不支持元素 <replace>

source: <replace> element requires 'token' and 'value' attributes
zh_cn: <replace> 元素需要 '标记' and '值' 属性

source: Processing replacement token {0} = {1}
zh_cn: 处理代替标记 {0} = {1}

source: Cannot construct URI with null/empty scheme!
zh_cn: 不能建立URI使用空的方案!

source: Cannot construct URI with null/empty scheme-specific part!
zh_cn: 不能建立URI使用空的方案-特别部分!

source: Scheme is required!
zh_cn: 要求方案!

source: Userinfo may not be specified if host is not specified!
zh_cn: 用户信息可能不能指定，如果没有指定主机!

source: Port may not be specified if host is not specified!
zh_cn: 端口可能不能指定，如果没有指定端口!!

source: Query string cannot be specified in path and query string!
zh_cn: 查询字符串不能指明的路径和查询字符串!

source: Fragment cannot be specified in both the path and fragment!
zh_cn: 片段不能在指定的路径和片段!

source: Cannot initialize URI with empty parameters.
zh_cn: 无法初始化的URI用空参数.

source: No scheme found in URI: {0}
zh_cn: 在URI没有发现方案: {0}

source: No scheme found in URI.
zh_cn: 在URI没有发现方案.

source: {0} is invalid.
zh_cn: {0}是无效.

source: Port should only contain digits!
zh_cn: 端口应只包含数字!

source: Cannot initialize path from null string!
zh_cn: 无法初始化路径用NULL字符串!

source: Path contains invalid escape sequence!
zh_cn: 路径包含无效的转义序列!

source: Path contains invalid character: {0}
zh_cn: 路径包含无效字符: {0}

source: Query string contains invalid escape sequence!
zh_cn: 查询字符串包含无效的转义序列!

source: Query string contains invalid character: {0}
zh_cn: 查询字符串包含无效字符: {0}

source: Fragment contains invalid escape sequence!
zh_cn: 片段中包含无效的转义序列!

source: Fragment contains invalid character: {0}
zh_cn: 片段中包含无效字符: {0}

source: Cannot set scheme from null string!
zh_cn: 不能将其设置方案从空字符串!

source: The scheme is not conformant.
zh_cn: 该方案是无效的.

source: Userinfo cannot be set when host is null!
zh_cn: 用户信息不能被设置当主机是空时

source: Userinfo contains invalid escape sequence!
zh_cn: 用户信息包含无效的转义序列!

source: Userinfo contains invalid character: {0}
zh_cn: 用户信息包含无效字符: {0}

source: Host is not a well formed address!
zh_cn: 主机不是一个很好形式的地址!

source: Port cannot be set when host is null!
zh_cn: 端口不能被设置当主机是空时!

source: Invalid port number!
zh_cn: 端口号无效!

source: Path contains invalid character!
zh_cn: 路径包含无效字符!

source: Query string can only be set for a generic URI!
zh_cn: 查询字符串只能为一个通用的URI设置!

source: Query string cannot be set when path is null!
zh_cn: 查询字符串不能设置当路径为空时!

source: Query string contains invalid character!
zh_cn: 查询字符串包含无效字符!

source: Fragment can only be set for a generic URI!
zh_cn: 片段只能被定为一种通用的URI!

source: Fragment cannot be set when path is null!
zh_cn: 片段无法设置当路径为空时!

source: Fragment contains invalid character!
zh_cn: 片段中包含无效字符!

source: Agent (Types)
zh_cn: Agent (类型)

source: Message resources for the OpenVPN-ALS Agent Application Type components.
zh_cn: OpenVPN-ALS代理应用程序类型的信息资源.

source: Application {0} cannot be loaded as it requires Java version {1}.
zh_cn: 应用程序 {0} 不能加载因为需要JAVA版本{1}.

source: The current installed version of Java is {2}.
zh_cn: 当前已装载的JAVA的版本是{2}.

source: No supported attributes in condition.
zh_cn: 没有支持的属性在这种条件。

source: Unexpected element <{0}> found
zh_cn: 不期望的元素 <{0}> 被发现

source: <if> element requires parameter attribute
zh_cn: <if> 元素需要参数属性

source: Unexpected element <{0}> found in <executable>
zh_cn: 不期望的元素<{0}> 找到<executable>

source: Executing command: {0}
zh_cn: 执行命令: {0}

source: Application requires that the working directory be changed, but this Java Virtual Machine does not support that.
zh_cn: 应用程序需要的工作目录改变，但这种Java虚拟机不支持该.

source: Process execution failed: {0}
zh_cn: 进程执行失败: {0}

source: Processing {0} for java application type
zh_cn: 处理{0} 为应用程序类型

source: Checking our version against the required application version {0}
zh_cn: 检查对我们的版本所需的应用程序版本 {0}

source: Application requires Java Runtime Environment {0}
zh_cn: 应用程序需要Java运行环境 {0}

source: Main class is {0}
zh_cn: 主类是 {0}

source: Dir is {0}
zh_cn: Dir是{0}

source: Finished preparing application descriptor.
zh_cn: 完成编写应用程序描述器.

source: Ignoring <{0}> tag as it is not a java application tag
zh_cn: 忽略 <{0}> 因为它不是一个Java应用程序标记

source: Adding {0} to CLASSPATH
zh_cn: 添加 {0} to CLASSPATH

source: Building classpath
zh_cn: 编译类路径

source: <if> element requires jre or parameter attribute
zh_cn: <if> 元素要求的JRE或参数属性

source: Invalid element <{0}> found in <classpath>
zh_cn: 无效元素 <{0}>发现在<classpath>

source: {0} has been appended to system property java.library.path
zh_cn: {0} 已附加到系统的属性 java.library.path

source: Invalid java.library.path system property: {0}
zh_cn: 无效的 java.library.path 系统属性: {0}

source: Unexpected element <{0}> found in <main>
zh_cn: 不期望的元素<{0}> 找到<main>

source: Application Shortcuts
zh_cn: 应用程序的快捷方式

source: Message resources for the OpenVPN-ALS Application Shortcuts feature
zh_cn: OpenVPN-ALS应用程序的快捷方式特点的信息资源

source: Application name:
zh_cn: 应用程序名字:

source: Application descriptor:
zh_cn: 应用程序描述器:

source: Application type:
zh_cn: 应用程序类型:

source: Missing application extension
zh_cn: 找不到应用程序extension

source: OpenVPN-ALS:::My Applications
zh_cn: OpenVPN-ALS:::我的应用程序

source: My Applications
zh_cn: 我的应用程序

source: Here you can launch applications that you have been granted access to.
zh_cn: 在这里，您可以启动应用程序，您已获准进入.

source: Please contact your network administrator if an application to which you require access is missing.
zh_cn: 请联系您的网络管理员，如果您的需要的应用程序，你没有权限

source: OpenVPN-ALS:::Applications
zh_cn: OpenVPN-ALS:::应用程序

source: Applications
zh_cn: 应用程序

source: Here you can access applications that have been published on the OpenVPN-ALS VPN server for online usage.
zh_cn: 在这里，您可以访问已发布在OpenVPN-ALS VPN服务器的应用程序，为在线使用.

source: A number of additional applications will also be available from the OpenVPN-ALS Application Store in the future.
zh_cn: 未来OpenVPN-ALS应用程序商店会有更多的应用程序

source: Favourites added.
zh_cn: 添加了收藏

source: {0} is already a favorite.
zh_cn: {0} 已经是收藏了.

source: Policies
zh_cn: 政策

source: Actions
zh_cn: 行为

source: There are currently no application shortcuts or none that you are allowed to edit.
zh_cn: 目前还没有申请或没有快捷方式，你可以编辑.

source: If allowed, you will be able to create a new application shortcut by selecting the <b>Create Application Shortcut</b> action.
zh_cn: 如果被允许的,你将可以创建一个新的应用程序快捷方式，用选择<b>创建Application快捷方式</b> 行为 .

source: No items match the provided filter.
zh_cn: 没有项目的符合使用的过滤器。

source: <strong>This application shortcut is attached to multiple policies :-</strong>
zh_cn: <strong>此应用程序的快捷方式连接到多个政策 :-</strong>

source: Remove this application
zh_cn: 删除此应用程序

source: Edit
zh_cn: 编辑

source: Edit this resource
zh_cn: 编辑此资源

source: Copy
zh_cn: 复制

source: Copy this resource
zh_cn: 复制此资源

source: Add Favorite
zh_cn: 添加我最喜爱的项

source: Add to my favorites.
zh_cn: 添加到我的收藏.

source: Remove Favorite
zh_cn: 删除我的收藏

source: Remove from my favorites.
zh_cn: 从我的收藏删除.

source: Create Application Shortcut
zh_cn: 创建应用程序快捷方式

source: Click here if you wish to create a new application thats launches one of the application extensions that have been installed.
zh_cn: 点击这里如果您想创建一个新的应用程序，可以启动启动一个已装载应用程序extensions.

source: Create Personal Application Shortcut
zh_cn: 创建个性化的应用程序快捷方式

source: Click here if you wish to create a new personal application thats launches one of the application extensions that have been installed.
zh_cn: 点击这里如果您想创建一个新的应用程序，可以启动启动一个已装载应用程序extensions..

source: OpenVPN-ALS:::Remove Application
zh_cn: OpenVPN-ALS:::删除应用程序

source: Confirm Remove Application
zh_cn: 确认删除应用程序

source: Are you sure you wish to remove this application?
zh_cn: 你确定你想要删除这个应用程序?

source: Yes
zh_cn: 是

source: No
zh_cn: 否

source: OpenVPN-ALS:::Create Application Shortcut
zh_cn: OpenVPN-ALS:::创建应用程序快捷方式

source: One or more fields contains errors.
zh_cn: 一个或多个子段有错误.

source: This application requires some parameters.
zh_cn: 此应用程序需要的一些参数.

source: Shortcut name
zh_cn: 快捷方式名称

source: Permission
zh_cn: 准许

source: Shortcut
zh_cn: 快捷方式

source: OpenVPN-ALS:::Edit Application Shortcut
zh_cn: OpenVPN-ALS:::编辑应用程序快捷方式

source: Edit Application Shortcut
zh_cn: 编辑应用程序快捷方式

source: Description
zh_cn: 描述

source: Save
zh_cn: 保存

source: Details
zh_cn: 详情

source: Failed to validate.
zh_cn: 无法验证

source: Application Shortcut has been changed.
zh_cn: 应用程序快捷方式被改了

source: OpenVPN-ALS Agent not active
zh_cn: OpenVPN-ALS 代理没有活动

source: This application requires the OpenVPN-ALS Agent to be active.
zh_cn: 此应用程序需要的OpenVPN-ALS代理是活动的.

source: OpenVPN-ALS::::Create Application
zh_cn: OpenVPN-ALS::::创建应用程序

source: The following wizard will guide you through the stages of creating a new <i>Application</i> and assigning it to one or more policies.
zh_cn: 下面的向导将引导您完成的各个阶段建立一个新的<i>应用程序</i> 并指派给一个或多个政策.

source: Create Application
zh_cn: 创建应用程序

source: Wizard
zh_cn: 向导

source: Application Extension
zh_cn: 应用程序Extension

source: Application Details
zh_cn: 应用程序详情

source: Application Options
zh_cn: 应用程序选项

source: Policy Selection
zh_cn: 政策选择

source: Resource Summary
zh_cn: 资源总结

source: Step 1 - Application Extension
zh_cn: 步骤1 - 应用程序Extension

source: Please select the application extension you wish this application to use
zh_cn: 请选择你希望的使用的应用程序extension

source: There are no applications available.
zh_cn: 没有所要的应用程序.

source: Please install one using the <a href="/showExtensionStore.do">Extension Manager</a>.
zh_cn: 请装载一个，用 <a href="/showExtensionStore.do">Extension管理器</a>.

source: Step 2 - Application Details
zh_cn: 步骤 2 - 应用程序详情

source: Please provide a name and description for this application shortcut.
zh_cn: 请提供名字和描述为这个应用程序快捷方式.

source: Name:
zh_cn: 名字:

source: Description:
zh_cn: 描述:

source: No application shortcut name has been provided.
zh_cn: 没有提供应用程序快捷方式名字.

source: You must provide a description for this application shortcut.
zh_cn: 你必须提供应用程序快捷方式的描述.

source: Application shortcut name must be {0} characters or less.
zh_cn: 应用程序快捷方式名字必须是{0} 字符

source: Failed to check for application shortcut by name.
zh_cn: 用名字检查应用程序快捷方式失败

source: Application shortcut named <strong>{0}</strong> already exists.
zh_cn: 应用程序快捷方式的名字<strong>{0}</strong> 已存在.

source: Step 3 - Application Options
zh_cn: 步骤 3 - 应用程序选项

source: Please provide the other information for launching this application
zh_cn: 请提供为启动这个应用程序的其他信息

source: Step 4 - Application Shortcut Policy Selection
zh_cn: 步骤 4 - 应用程序快捷方式的政策选择

source: Choose the policies you wish to attach this application shortcut to.
zh_cn: 选择你愿意连接这个应用程序快捷方式的政策.

source: You must select at least one policy to attach this application shortcut.
zh_cn: 您必须至少选择一个政策，连接此应用程序的快捷方式

source: Your personal Application Shortcut is going to be attached to your personal policy: "{0}"<br/>Please know that an admin may, at everytime, see, edit and deleted your personal resource and policy.
zh_cn: 您的个人应用程序的快捷方式将是附加到您的个人的政策: "{0}"<br/>请注意，管理员可以在每次看见，修改和删除您的个人资源和政策

source: Step 5 - Application Shortcut Summary
zh_cn: 步骤 5 - 应用程序快捷方式总结

source: Review the information below before clicking on <strong>Finish</strong> to create the application shortcut.
zh_cn: 检查以下信息，在点击前<strong>完成</strong> 创建应用程序快捷方式

source: Resource
zh_cn: 资源

source: Application Shortcut Name:
zh_cn: 应用程序快捷方式名字::

source: Names:
zh_cn: 名字组:

source: No policies have been selected.
zh_cn: 没有选择政策.

source: No user will be able to access this resource.
zh_cn: 没有用户可以使用这个资源

source: Application Shortcut Created
zh_cn: 应用程序快捷方式已创建

source: The application shortcut creation wizard is now complete.
zh_cn: 快捷方式的应用创建向导现已完成.

source: Please review any information below.
zh_cn: 请检查下面的信息

source: All steps completed OK.
zh_cn: 所有的步骤全部完成

source: Click <strong>Exit Wizard</strong> to finish.
zh_cn: 点击 <strong>，退出向导</strong> 完成.

source: The creation of the application shortcut failed.
zh_cn: 建立应用程序快捷方式失败

source: Please review any errors or warnings and either retry by clicking on <strong>Run Again</strong>, or click <strong>Exit Wizard</strong> to leave the wizard now.
zh_cn: 请检阅任何错误或警告，并可以通过点击重试<strong>再次运行</strong>, 或者点击<strong>退出向导</strong> 现在退出向导

source: The creation of the application shortcut is complete, but some warnings occurred.
zh_cn: 建立了应用程序快捷方式完成，但一些警告发生.

source: Please review the warnings and either retry by clicking on <strong>Run Again</strong>, or click <strong>Exit Wizard</strong> to leave the wizard now.
zh_cn: 请检阅任何警告，并可以通过点击重试<strong>再次运行</strong>, 或者点击<strong>退出向导</strong> 现在退出向导

source: Application shortcut created
zh_cn: 应用程序快捷方式已创建

source: Attached application shortcut to policies.
zh_cn: 连接应用程序快捷方式的政策.

source: Failed to attach to resource to policies.
zh_cn: 连接资源的政策失败

source: Failed to create new application shortcut.
zh_cn: 未能创造新的应用程序快捷方式.

source: Exit Wizard
zh_cn: 退出向导

source: Run Again
zh_cn: 再次运行

source: Application shortcut saved.
zh_cn: 应用程序快捷方式已保存.

source: Application {0} launched.
zh_cn: 应用程序 {0} 已启动.

source: Agent refused to launch application.
zh_cn: 代理拒绝启动应用程序.

source: No agent.
zh_cn: 没有代理.

source: Publish applications for download and launching through OpenVPN-ALS.
zh_cn: 为下载和启动应用程序，通过OpenVPN-ALS发布.

source: Access applications that have been configured for you
zh_cn: 使用应用程序已为你配置

source: Agent Executable Application
zh_cn: 代理可执行的应用程序

source: Agent Java Application
zh_cn: 代理Java应用程序

source: Server Java Application
zh_cn: 服务器Java应用程序

source: Server Executable
zh_cn: 可执行的服务器

source: Application Shortcut Edited
zh_cn: 应用程序快捷方式已编辑

source: Application Shortcut Deleted
zh_cn: 应用程序快捷方式已删除

source: Application Shortcut Launched
zh_cn: 应用程序快捷方式已启动

source: Users will be retrieved and authenticated using the local <strong>/etc/passwd</strong>, <strong>/etc/shadow</strong> and <strong>/etc/group</strong> files.
zh_cn: 用户将检索和验证使用的是本地l <strong>/etc/passwd</strong>, <strong>/etc/shadow</strong> and <strong>/etc/group</strong> 文件.

source: This option is currently known to work on Linux and Solaris servers.
zh_cn: 这个选项是目前已知的工作在Linux和Solaris服务器.

source: Errors
zh_cn: 错误

source: Message resources for the OpenVPN-ALS global error messages
zh_cn: OpenVPN-ALS全球错误信息的信息资源

source: No '{0}' parameter supplied.
zh_cn: 没有 '{0}' 提供参数.

source: Internal error.
zh_cn: 内部错误.

source: No application named {0}.
zh_cn: 没有命名应用程序 {0}.

source: Request for an unknown extension ({0}) has been made.
zh_cn: 要求一个不知道的 extension ({0}) 被启动.

source: Failed to parse extension descriptor.
zh_cn: 无法解析extension描述.

source: Unknown extension type '{0}' in extension '{1}'.
zh_cn: 不知道的extension类型 '{0}' 在extension '{1}'.

source: Failed to process extension descriptor.
zh_cn: 无法处理extension描述器.

source: The plugin {0} requires that OpenVPN-ALS is at least of version {1}
zh_cn: 插件{0}要求OpenVPN-ALS的版本至少是 {1}

source: The plugin instance for {0} ({1}) could not be created.
zh_cn: 插件事例为了{0} ({1}) 不能被创建.

source: Invalid extension bundle status for {0}.
zh_cn: 无效extension状态为 {0}.

source: Unknown plugin {0}.
zh_cn: 不知道的插件{0}.

source: The extension '{1}' has '{0}' as a dependency.
zh_cn: extension '{1}' 要 '{0}' 为前提.

source: This dependency is not installed.
zh_cn: 这个前提没有被装载.

source: This dependency is not started.
zh_cn: 这个前提没有被启动.
